[
  {
    "exp": 12,
    "name": "JavaScript",
    "desc": "Leon writes JavaScript day-to-day and strives for simple and concise code, with progressive enhancement and graceful degredation as the hallmark of his style."
  },
  {
    "exp": 12,
    "name": "CSS",
    "desc": "Leon is an advocate of CSS and strives to use CSS appropriately rather than making a JS sledgehammer to fix all problems."
  },
  {
    "exp": 12,
    "name": "HTML",
    "desc": "Leon has been following HTML standards since learning about semantic mark-up and how difficult browsing the web can be for people with accessibility needs."
  },
  {
    "exp": 8,
    "name": "Node.js",
    "desc": "Leon uses Node extensively for his local development setup and in building Capgemini tools such as the Cloud Automation tool for SAP Systems."
  },
  {
    "exp": 2,
    "name": "React",
    "desc": "Leon has developed his own component-based interfaces in plain JS before beginning his React journey. Leon has since designed, built and delivered the Capgemini Advisory Solutions application, built in React with Material UI. This project was subsequently adopted by Capgemini Group and is now used globally for Advisory assessment & change management"
  },
  {
    "exp": 9,
    "name": "SAPUI5",
    "desc": "Leon builds enterprise SAPUI5 applications in his day-job and is intimately familiar with the framework and it's shortcomings. This combined with Leons knowledge of the web makes him invaluable when advising on technologies and implementation/integration strategies."
  },
  {
    "exp": 0,
    "name": "Web APIs",
    "desc": "Leon follows Web Standards and is engaging at the explainer level to better understand and contribute to the growth of the web."
  },
  {
    "exp": 9,
    "name": "SAP",
    "desc": "Leon has worked on high-profile SAP projects, ranging from huge S/4hana transformations to customising Work Manager using open web extensions."
  },
  {
    "exp": 9,
    "name": "Fiori",
    "desc": "Leon is an expert in Fiori guidelines and has vast experience in designing and developing applications that adhere to Fiori design principles. Leon has been focused on developing additional capability within his team for Fiori in other JS frameworks such as React."
  },
  {
    "exp": 0,
    "name": "Design Thinking",
    "desc": "Leon is certified in the IDEO Design Thinking methodology and a vocal advocate of the accompanying toolset. Leon believes that collaboration is the cornerstone of success when delivering software."
  },
  {
    "exp": 0,
    "name": "Agile",
    "desc": "Leon is an evangelist for Agile Methodologies, showcasing the difference between a truly Agile delivery and enterprise Wagile/Waterfall. Leon is a certified Professional Scrum Master."
  },
  {
    "exp": 0,
    "name": "BTP",
    "desc": "Leon has worked with the SAP Business Technology Platform (previously SCP) extensively and has experience in the Extension suite and API Management."
  },
  {
    "exp": 0,
    "name": "SAP Author",
    "desc": "SAP Press released Leon's book \"Visual Studio Code for SAP\" in 2022, it covers building SAP applications in several technologies using VS Code and highlights development best practices."
  }
]
